---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
WireframeBuilder Properties
WireframeBuilder Class See Also Send Feedback
---

The WireframeBuilder type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from ShapeBuilder.) |

# See Also

WireframeBuilder Class

Autodesk.Revit.DB Namespace